{
    "en": {
        "intro_text": "You can use this editor to create or modify ShortEvents.<br><br>While this greatly simplifies the process, you should still reference the <a href=https://clangen.io/docs/dev/writing/shortevents/>Official Documentation</a> for more information on each field. Our Discord is a good place to find extra help. If you have the dev role, feel free to ask for help in dev channels if you find you need it.<br><br>To edit an existing event, use the upper tab buttons to navigate to the file you'd like to edit. Once a type and biome is selected, all the current events will be displayed as their event_ids. Select one to begin editing it.<br><br>If you'd like to create a new event, you can use the lower tab to start the process. Fill in all necessary fields (required fields will be marked by a *) and then save the event to add it to the game's files. Any dropdowns or multi-selects should provide all available options. But, please don't rely on this editor to inform you of all intricacies! Once again, the <a href=https://clangen.io/docs/dev/writing/shortevents/>Official Documentation</a> should be referenced while writing.<br><br>If you would like to make bulk changes to multiple events at a time, this tool will not be helpful!",
        "empty_event_list": "There's no events for this type and biome.",
        "empty_event_id": "be sure to add an id!",
        "location_info": "<b>location:</b> Click to add or remove a place as a location for the event. Only include the biome name if any camp is applicable.",
        "season_info": "<b>season:</b> Click to add or remove a required season for this event.",
        "subtype_info": "<b>subtypes:</b> Click to add or remove a subtype for this event.",
        "classic": "Is this limited to classic mode?",
        "cruel_season": "Is this limited to cruel season?",
        "no_body": "Is the dead cat's body irretrievable?",
        "clan_wide": "Should all involved cat buttons be hidden?",
        "romance": "Can m_c and r_c be romantic?",
        "adoption": "Is an adoption occurring?"
    }
}